Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Both `quarkus.oidc.client-id` and `quarkus.oidc.credentials.secret` are optional when JWT bearer access tokens are accepted since they can be verified locally with the JWK verification keys available from a public OIDC JWKS key set endpoint. However, configuring `quarkus.oidc.client-id` is RECOMMENDED in this case anyway to make the OIDC log messages more informative.
ja_jp: JWT ベアラーアクセストークンを受け入れる場合、公開 OIDC JWKS キーセットエンドポイントから利用可能な JWK 検証キーを使用してローカルで検証できるため、 `quarkus.oidc.client-id` と `quarkus.oidc.credentials.secret` は両方とも任意です。ただし、この場合でも OIDC ログメッセージの情報をより充実させるために、 `quarkus.oidc.client-id` を設定することが推奨されます。

source: Both are configured via unified and flexible configuration.
ja_jp: どちらも統一された柔軟な構成で構成されています。

source: Both codestarts and quickstarts are designed to help users get coding quickly. A codestarts is a generated application and a quickstart is browsable source code. Codestarts allow the creation of customised apps, which makes them quite powerful.
ja_jp: コードスタートとクイックスタートはどちらも、ユーザーがすぐにコーディングを始められるように設計されています。 コードスタートは生成されたアプリケーションであり、クイックスタートは参照可能なソースコードです。 Codestarts を使用すると、カスタマイズされたアプリケーションを作成できるため、非常に強力です。

source: Both configuration properties support glob patterns.
ja_jp: どちらの設定プロパティーもグロブパターンに対応しています。

source: Both configurations map to the same Keycloak server instance while using distinct `realms`.
ja_jp: 両方の設定は、異なる `realms` を使用しながら、同じ Keycloak サーバーインスタンスにマップされます。

source: Both configurations related to standard and non-standard headers can be combined, although the standard headers configuration will have precedence.
ja_jp: 標準ヘッダーに関する設定と非標準ヘッダーに関する設定の両方を組み合わせることができますが、標準ヘッダーに関する設定が優先されます。

source: Both configurations related to standard and non-standard headers can be combined, although the standard headers configuration will have precedence. However, combining them has security implications as clients can forge requests with a forwarded header that is not overwritten by the proxy. Therefore, proxies should strip unexpected `Forwarded` or `X-Forwarded-*` headers from the client.
ja_jp: 標準ヘッダーと非標準ヘッダーに関連する両方の設定を組み合わせることができますが、標準ヘッダーの設定が優先されます。ただし、これらを組み合わせると、プロキシーによって上書きされない forwarded ヘッダーを使用してクライアントがリクエストを偽造できるため、セキュリティーに影響があります。したがって、プロキシーはクライアントから予期しない `Forwarded` または `X-Forwarded-*` ヘッダーを削除する必要があります。

source: Both configurations related to standard and non-standard headers can be combined, although the standard headers configuration will have precedence. However, combining them has security implications as clients can forge requests with a forwarded header that is not overwritten by the proxy. Therefore, proxies should strip unexpected `X-Forwarded` or `X-Forwarded-*` headers from the client.
ja_jp: 標準ヘッダーと非標準ヘッダーに関連する設定はどちらも組み合わせることが できるますが、標準ヘッダーの設定が優先されます。しかしながら、これらを組み合わせることは、クライアントがプロキシにーよって上書きされない転送 ( forward ) ヘッダーを持つリクエストを偽造することができるため、セキュリティ上の影響があります。したがって、プロキシーはクライアントから予期しない `X-Forwarded` ヘッダまたは `X-Forwarded-*` ヘッダを取り除く必要があります。

source: Both endpoints return the username extracted from the incoming access token, which was propagated to `ProtectedResource` from `FrontendResource`. The only difference between these endpoints is that calling `/protected/user-name` is only allowed if the current access token has a `user` role, and calling `/protected/admin-name` is only allowed if the current access token has an `admin` role.
ja_jp: どちらのエンドポイントも、 `FrontendResource` から `ProtectedResource` に伝搬された受信アクセストークンから抽出したユーザー名を返します。これらのエンドポイントの唯一の違いは、 `/protected/user-name` の呼び出しは、現在のアクセストークンに `user` ロールがある場合にのみ、 `/protected/admin-name` の呼び出しは、現在のアクセストークンに `admin` ロールがある場合のみ許可されることです。

source: Both kinds of key generators can be used in a similar way:
ja_jp: どちらの種類のキージェネレーターも、同様の方法で使用することができます。

source: Both of these endpoints return the username extracted from the incoming access token which was propagated to `ProtectedResource` from `FrontendResource`. The only difference between these endpoints is that calling `/protected/user-name` is only allowed if the current access token has a `user` role and calling `/protected/admin-name` is only allowed if the current access token has an `admin` role.
ja_jp: これらのエンドポイントはどちらも、 `FrontendResource` から `ProtectedResource` に伝搬された受信アクセストークンから抽出したユーザー名を返します。これらのエンドポイントの唯一の違いは、 `/protected/user-name` の呼び出しは、現在のアクセストークンが `user` ロールを持つ場合にのみ許可され、 `/protected/admin-name` の呼び出しは、現在のアクセストークンが `admin` ロールを持つ場合のみ許可されることです。

source: Both of these extensions register a special `ContainerResponseFilter` implementation which enables resource methods to return a `TemplateInstance`, thus freeing users of having to take care of all necessary internal steps.
ja_jp: これらのエクステンションはどちらも、リソースメソッドが `TemplateInstance` を返すことを可能にする特別な `ContainerResponseFilter` 実装を登録しています。そのため、ユーザーは必要なすべての内部ステップを処理する必要がなくなります。

source: Both of these extensions register a special response filter which enables resource methods to return a `TemplateInstance`, thus freeing users of having to take care of all necessary internal steps.
ja_jp: これら両方のエクステンションは、リソースメソッドが `TemplateInstance` を返せるようにする特別な応答フィルターを登録します。そのため、ユーザーによる内部ステップの処理が不要になります。

source: Both of these properties are also usually required if the tokens must be introspected, both for the bearer access token and authorization code flows.
ja_jp: ベアラーアクセストークンフローと認可コードフローの両方において、トークンをイントロスペクションする必要がある場合、通常はこれら両方のプロパティーが必要になります。

source: Both properties accept a comma-separated list of valid metric names.
ja_jp: どちらのプロパティーにも、有効なメトリクス名をコンマ区切りにした一覧を使用できます。

source: Both responses would also contain these headers:
ja_jp: 両方のレスポンスには、これらのヘッダも含まれています:

source: Both static metamodel and Jakarta Data capabilities of Hibernate ORM are available in Quarkus through the `hibernate-processor` annotation processor. Since it is an annotation processor, you must configure it accordingly in your build tool:
ja_jp: Hibernate ORM の静的メタモデルと Jakarta Data の機能は、両方とも `hibernate-processor` アノテーションプロセッサーを介して Quarkus で利用可能です。これはアノテーションプロセッサーであるため、ビルドツールで適切に設定する必要があります。

source: Both the <<server-api>> and <<client-api>> define _endpoints_ that are used to consume and send messages. The endpoints are implemented as CDI beans and support injection. Endpoints declare <<callback-methods,_callback methods_>> annotated with `@OnTextMessage`, `@OnBinaryMessage`, `@OnPingMessage`, `@OnPongMessage`, `@OnOpen`, `@OnClose` and `@OnError`. These methods are used to handle various WebSocket events. Typically, a method annotated with `@OnTextMessage` is called when the connected client sends a message to the server and vice versa.
ja_jp: <<server-api>> and <<client-api>> は両方とも、メッセージを消費および送信するために使用される _エンドポイント_ を定義します。 エンドポイントは CDI Bean として実装され、注入をサポートします。 エンドポイントは、 `@OnTextMessage`、 `@OnBinaryMessage`、 `@OnPingMessage`、 `@OnPongMessage`、 `@OnOpen`、 `@OnClose` および `@OnError` アノテーションが付けられた <<callback-methods,_callback methods_>> を宣言します。 これらのメソッドは、さまざまな WebSocket イベントを処理するために使用されます。 通常、接続されたクライアントがサーバーにメッセージを送信するとき、およびサーバーが接続されたクライアントにメッセージを送信するときに、 `@OnTextMessage` アノテーションが付けられたメソッドが呼び出されます。

source: Both the <<vertx-oidc-vertx>> and <<vertx-oidc-quarkus>> sections demonstrate how you can retrict access to the Vert.x OIDC application by enforcing that the GitHub access token has a `user:email` scope.
ja_jp: <<vertx-oidc-vertx>> および <<vertx-oidc-quarkus>> の両セクションでは、GitHub アクセストークンに `user:email` スコープがあることを強制することで、Vert.x OIDC アプリケーションへのアクセスを制限する方法を説明しました。

source: Both the `embedded.html` files and any full page you add in `/dev-templates` will be interpreted by xref:qute.adoc[the Qute template engine].
ja_jp: `embedded.html` のファイルも、 `/dev-templates` で追加したフルページも、 link:qute.html[Qute テンプレートエンジン]によって解釈されます。

source: Both the `io.quarkus.oidc.common.OidcRequestFilter` and the `io.quarkus.oidc.common.OidcResponseFilter` filters can be restricted to specific tenants like in the example below:
ja_jp: `io.quarkus.oidc.common.OidcRequestFilter` と `io.quarkus.oidc.common.OidcResponseFilter` の両方のフィルターは、以下の例のように特定のテナントに制限できます。

source: Both the key and the value are marshalled using Protobuf with Protostream.
ja_jp: キーと値の両方が Protostream を使用して Protobuf でマーシャリングされます。

source: Both these styles are fully supported in the Drools Quarkus extension and this document explains how to use both, outlining the pros and cons of each one.
ja_jp: これら両方のスタイルは Drools Quarkus エクステンションで完全にサポートされており、このドキュメントでは両方の使用方法を説明し、それぞれの長所と短所を概説します。

source: Both timers and distribution summaries can be configured to emit additional statistics, like histogram data, precomputed percentiles, or service level objective (SLO) boundaries. Note that the count, sum, and histogram data can be re-aggregated across dimensions (or across a series of instances), while precomputed percentile values cannot.
ja_jp: タイマーとディストリビューションサマリーは、ヒストグラムデータ、事前に計算されたパーセンタイル、サービスレベル目標（SLO）の境界線など、追加の統計情報を出力するように設定できます。カウント、サム、ヒストグラムのデータは、ディメンション間（または一連のインスタンス間）で再集計できますが、事前に計算されたパーセンタイル値はできないことに注意してください。

source: Both timers and distribution summaries can be configured to emit additional statistics, like histogram data, precomputed percentiles, or service level objective (SLO) boundaries. See link:{concepts}#_timers[Timers] and link:{concepts}#_distribution_summaries[Distribution Summaries] in the Micrometer documentation for more information and examples, including memory footprint estimation for both types.
ja_jp: タイマーとディストリビューションサマリーの両方は、ヒストグラムデータ、事前計算されたパーセンタイル、またはサービスレベル目標 (SLO) 境界などの追加の統計情報を発行するように設定できます。 詳細や例については、Micrometer ドキュメントの link:{concepts}#_timers[Timers] および link:{concepts}#_distribution_summaries[Distribution Summaries] を参照してください。これらのドキュメントには、両方のタイプのメモリー使用量の推定についても説明されています。

source: Both timers and distribution summaries can be configured to emit additional statistics, like histogram data, precomputed percentiles, or service level objective (SLO) boundaries. See link:{concepts}/timers[Timers] and link:{concepts}/distribution-summaries[Distribution Summaries] in the Micrometer documentation for more information and examples, including memory footprint estimation for both types.
ja_jp: タイマと分布サマリはどちらも、ヒストグラム・データ、事前計算されたパーセンタイル、サービス・レベル目標（SLO）境界などの追加統計を出力するように設定できます。 両タイプのメモリ・フットプリントの推定など、詳細な情報や例については、Micrometerドキュメントの link:{concepts}/timers[Timer] and link:{concepts}/distribution-summaries[Distribution Summaries] を参照してください。

source: Both v2 (8-byte) and v3 (4-byte) formats use the same magic byte. The standard ID handlers (`Legacy8ByteIdHandler` and `Default4ByteIdHandler`) read a fixed number of bytes based on configuration—there is no per-message auto-detection.
ja_jp: v2 (8 バイト) と v3 (4 バイト) の両形式は同じマジックバイトを使用します。標準 ID ハンドラー (`Legacy8ByteIdHandler` および `Default4ByteIdHandler`) は、設定に基づいて固定数のバイトを読み取ります。メッセージごとの自動検出はありません。

source: Both versions are fixing https://quarkus.io/blog/quarkus-2-10-3-final-released/[CVE-2022-2466] in the SmallRye GraphQL server extension (for real this time). Unfortunately, the previous fix introduced in 2.10.3.Final and the non-released 2.11.0.Final was incomplete and the issue was still present in another form.
ja_jp: どちらのバージョンも、SmallRye GraphQLサーバーエクステンションの link:https://quarkus.io/blog/quarkus-2-10-3-final-released/[CVE-2022-2466] を（今回は本当に）修正しています。残念ながら、2.10.3.Finalと非リリースの2.11.0.Finalで導入した前回の修正は不完全で、問題は別の形でまだ存在していました。

source: Both xref:hibernate-reactive.adoc[Hibernate Reactive] and xref:hibernate-reactive-panache.adoc[Hibernate Reactive with Panache] can be used with the `quarkus-security-jpa-reactive` extension.
ja_jp: xref:hibernate-reactive.adoc[Hibernate Reactive] と xref:hibernate-reactive-panache.adoc[Hibernate Reactive と Panache] はどちらも `quarkus-security-jpa-reactive` エクステンションで使用できます。

source: Bounded near caching
ja_jp: 境界付けられたニアキャッシング

source: Boxed primitives: `java.lang.Boolean`, `java.lang.Byte`, `java.lang.Short`, etc.
ja_jp: ボックス化されたプリミティブ: `java.lang.Boolean`、 `java.lang.Byte`、 `java.lang.Short` など

source: Brand
ja_jp: ブランド

source: Breaking Changes
ja_jp: 破壊的変更

source: Breaking Changes Summary
ja_jp: 破壊的な変更の概要

source: Breaking change in 3.9
ja_jp: 3.9での変更点

source: Breaking this example apart, we are using the `xref` macro to refer to another file (`xref:<name-of-the-file>.adoc[Human-readable label]`) and inserting the anchor ID for the target section (`#title-heading`) just after the file name.
ja_jp: この例を分解すると、 `xref` マクロを使用して別のファイルを参照しています (`xref:<name-of-the-file>.adoc[人間が読めるラベル]`) を作成し、ファイル名の直後に対象セクションのアンカー ID (`#title-heading`) を挿入します。

source: Bringing virtual threads to reactive REST services
ja_jp: リアクティブなRESTサービスに仮想スレッドを導入する

source: Brings lightning fast startup time to Java applications
ja_jp: Java アプリケーションの起動時間を大幅に短縮します

source: Brings under one programming model non blocking and imperative styles of development
ja_jp: ノンブロッキングと命令型の開発スタイルを 1 つのプログラミングモデルにまとめました。

source: Broadcasting messages on multiple consumers
ja_jp: 複数のコンシューマーでのメッセージのブロードキャスト

source: Broken only mode will only run tests that have previously failed, even if other tests would normally be affected by a code change. This can be useful if you are modifying code that is used by lots of tests, but you only want to focus on debugging the failing one.
ja_jp: Broken only モードでは、コードの変更によって他のテストが影響を受ける場合でも、 過去に失敗したテストのみを実行します。これは、多くのテストで使用されているコードを変更する際に、 失敗したテストのデバッグだけに集中したい場合などに便利です。

source: Brotli compression is not available by default. You can enable it by setting `quarkus.http.compressors=deflate,gzip,br`. In case of building native image, it adds around 1MB to your executable size.
ja_jp: Brotli 圧縮はデフォルトでは利用できません。`quarkus.http.compressors=deflate,gzip,br` を設定することで有効にできます。ネイティブイメージをビルドする場合、実行可能ファイルのサイズが約 1 MB 増加します。

source: Brotli4J and cross-platform support
ja_jp: Brotli4J とクロスプラットフォームのサポート

source: Brotli4J is a native library that provides support for the Brotli compression algorithm. By default, Quarkus includes the Brotli native library matching the platform you are running on. But sometimes, you need to include the native library for a different platform.
ja_jp: Brotli4J は、Brotli 圧縮アルゴリズムのサポートを提供するネイティブライブラリーです。 Quarkus には、ご使用のプラットフォームに合った Brotli ネイティブライブラリーがデフォルトで含まれています。 ただし、場合によっては、別のプラットフォーム用のネイティブライブラリーを含める必要があります。

source: Browse through these selections of new Quarkus related books and resources to expand your knowledge and hone your coding skills to step up your Quarkus game.
ja_jp: 選りすぐりの新しいQuarkus関連書籍、リソースを読み、知識を広げ、コーディングスキルを磨いてQuarkusへの取組を強化して下さい。

source: Bugs / Feature requests
ja_jp: バグ / 機能リクエスト

source: Build Container Images
ja_jp: ビルドコンテナイメージ

source: Build Items
ja_jp: ビルドアイテム

source: Build Native Container
ja_jp: ネイティブコンテナのビルド

source: Build Project
ja_jp: プロジェクトのビルド

source: Build Step Processors
ja_jp: ビルドステッププロセッサー

source: Build System Sources (provided by Maven or Gradle)
ja_jp: ビルドシステムソース (Maven または Gradle によって提供されるもの)

source: Build Time Extensions
ja_jp: ビルド時エクステンション

source: Build Time Processing
ja_jp: ビルド時処理

source: Build Time configuration
ja_jp: ビルド時設定

source: Build a container friendly executable
ja_jp: コンテナーフレンドリーな実行可能ファイルをビルドする

source: Build a container image from scratch
ja_jp: コンテナーイメージをゼロから構築する

source: Build an attractive web UI on top of these REST methods to visualize the timetable.
ja_jp: これらの REST メソッドに魅力的な Web UI を構築して、タイムテーブルを視覚化します。

source: Build analytics
ja_jp: ビルド分析

source: Build and Deploy
ja_jp: ビルドとデプロイ

source: Build and Deploy to Azure
ja_jp: ビルドと Azure へのデプロイ

source: Build and Deploy to Google Cloud
ja_jp: アプリケーションのビルドと Google Cloud へのデプロイ

source: Build and Deployment
ja_jp: ビルドとデプロイメント

source: Build and deploy your Quarkus App using Ansible
ja_jp: Ansibleを使用したQuarkusアプリのビルドとデプロイ

source: Build and hosting infrastructure for extensions
ja_jp: エクステンションのインフラストラクチャーの構築とホスティング

source: Build and push the container image
ja_jp: コンテナーイメージのビルドとプッシュ

source: Build and send the response.
ja_jp: レスポンスを構築して送信します。

source: Build configuration is all within `application.properties`. The only required configuration switch is `quarkus.azure-functions.app-name`.
ja_jp: ビルド設定はすべて `application.properties` 内にあります。唯一必要な設定スイッチは `quarkus.azure-functions.app-name` です。

source: Build configuration is now all within `application.properties`. The only required configuration switch is `quarkus.azure-functions.app-name`.
ja_jp: ビルド設定はすべて `application.properties` 内にあります。唯一必要な設定スイッチ は `quarkus.azure-functions.app-name` です。

source: Build containers for application using virtual threads
ja_jp: 仮想スレッドを使用したアプリケーションのコンテナーのビルド

source: Build distroless image using cekit in ci https://github.com/quarkusio/quarkus-images/pull/118[#118] (merged)
ja_jp: ci で cekit を使って distroless イメージをビルド link:https://github.com/quarkusio/quarkus-images/pull/118[#118](merged)

source: Build fully static native executables
ja_jp: 完全に静的なネイティブ実行可能ファイルの作成

source: Build items
ja_jp: ビルドアイテム

source: Build items are concrete, final subclasses of the abstract `io.quarkus.builder.item.BuildItem` class. Each build item represents some unit of information that must be passed from one stage to another. The base `BuildItem` class may not itself be directly subclassed; rather, there are abstract subclasses for each of the kinds of build item subclasses that _may_ be created: <<simple-build-items,simple>>, <<multi-build-items,multi>>, and <<empty-build-items,empty>>.
ja_jp: ビルド項目は、抽象クラス `io.quarkus.builder.item.BuildItem` の具体的で最終的なサブクラスです。各ビルド項目は、 ある段階から別の段階へ渡す必要がある情報の単位を表します。ベースとなる `BuildItem` クラス自体は直接サブクラス化できません。 その代わりに、作成 _可能_ なビルド項目のサブクラスの種類ごとに、抽象的なサブクラスがあります: <<simple-build-items,simple>>、<<multi-build-items,multi>>、<<empty-build-items,empty>>

source: Build native executables with GraalVM or Mandrel.
ja_jp: GraalVMやMandrelを使ってネイティブ実行可能ファイルをビルドします。

source: Build predictive models with DeepLearning4J (DL4J). Java’s ecosystem, including Apache Kafka, Apache Flink, and Apache Camel, supports large-scale ETL, data cleansing, and preprocessing across enterprise data.
ja_jp: DeepLearning4J (DL4J) を使用して予測モデルを構築します。Apache Kafka、Apache Flink、Apache Camel を含む Java のエコシステムは、エンタープライズデータ全体における大規模な ETL、データクレンジング、前処理をサポートします。

source: Build stalled for minutes, barely using any CPU
ja_jp: ビルドが数分間停止し、CPU をほとんど使用していない

source: Build step classes are instantiated and injected for each build step invocation, and are discarded afterwards. State should only be communicated between build steps by way of build items, even if the steps are on the same class.
ja_jp: ビルド・ステップ・クラスは、ビルド・ステップを呼び出すたびにインスタンス化され、注入され、その後は破棄されます。ビルドステップ間では、たとえ同じクラスであっても、ビルドアイテムを介してのみ状態が伝達されるべきです。

source: Build steps
ja_jp: ビルドステップ

source: Build steps are executed if and only if they produce build items that are (transitively) needed by other build steps. Make sure your build step produces a build item, otherwise you should probably produce either `ValidationErrorBuildItem` for build validations, or `ArtifactResultBuildItem` for generated artifacts.
ja_jp: ビルドステップは、他のビルドステップが（推移的に）必要とするビルドアイテムを生成する場合にのみ、実行されます。ビルドステップがビルドアイテムを生成することを確認してください。そうでない場合は、ビルド検証用に `ValidationErrorBuildItem` を生成するか、生成されたアーティファクト用に `ArtifactResultBuildItem` を生成すべきです。

source: Build steps are normally placed on plain classes within an extension's deployment module. The classes are automatically instantiated during the augment process and utilize <<injection,injection>>.
ja_jp: ビルドステップは通常、エクステンションのデプロイメントモジュール内のプレーンなクラスに配置されます。このクラスは、 拡張プロセス中に自動的にインスタンス化され、<<injection,injection>> を利用します。

source: Build steps can query the transformed annotations for a given annotation target via the `TransformedAnnotationsBuildItem`.
ja_jp: ビルドステップでは、 `TransformedAnnotationsBuildItem` を介して、特定のアノテーションターゲットの変換済みアノテーションをクエリーできます。

source: Build strategies supported by Quarkus
ja_jp: Quarkusがサポートするビルドストラテジー

source: Build strategy
ja_jp: ビルドストラテジー

source: Build system details, such as Maven, Gradle, and so on.
ja_jp: ビルドシステムの詳細、Maven、Gradleなど。

source: Build the Docker image
ja_jp: Docker イメージのビルド

source: Build the Project
ja_jp: プロジェクトのビルド

source: Build the `docs` module locally
ja_jp: `docs` モジュールをローカルでビルド

source: Build the `docs` module to view the rendered results.
ja_jp: `docs` モジュールをビルドして、レンダリング結果を確認する。

source: Build the extension to regenerate content in `target/asciidoc/generated/config/`
ja_jp: `target/asciidoc/generated/config/` にコンテンツを生成するためにエクステンションをビルドする

source: Build the gauge with a callback. An imperative builder is also available.
ja_jp: コールバックを使用してゲージを構築します。 命令型ビルダーも利用可能です。

source: Build the native binary:
ja_jp: ネイティブバイナリーをビルドします。

source: Build the native executable as indicated on xref:./building-native-image.adoc[the native compilation guide]. For example, with Maven, run:
ja_jp: xref:./building-native-image.adoc[ネイティブコンパイルガイド] に示されているように、ネイティブ実行可能ファイルをビルドします。 たとえば、Maven の場合は、以下を実行します。

source: Build the native executable with debug info:
ja_jp: デバッグ情報付きでネイティブ実行可能ファイルをビルドします。

source: Build the project using Maven:
ja_jp: maven を使用してプロジェクトをビルドします。

source: Build the project, create the application, and deploy the {openshift} service.
ja_jp: プロジェクトをビルドし、アプリケーションを作成し、{openshift} サービスをデプロイします。

source: Build the project, create the application, and deploy the {openshift} service:
ja_jp: プロジェクトをビルドし、アプリケーションを作成し、 {openshift} サービスをデプロイします：

source: Build the project:
ja_jp: プロジェクトのビルド

source: Build time CDI dependency injection
ja_jp: ビルド時 CDI 依存性注入

source: Build time configuration
ja_jp: ビルド時設定

source: Build time configuration provided by build tools (`properties` in Maven `pom.xml` or `gradle.properties` in Gradle) in the `quarkus` namespace will be part of the `mutable-jar` distribution, including configuration from `quarkus` that reference secrets or passwords. Please, do not include sensitive information in the build tool configuration files.
ja_jp: `quarkus` namespace でビルドツールによって提供されるビルド時の設定 (Maven `pom.xml` の `properties` または Gradle の `gradle.properties`) は、 `mutable-jar`ディストリビューションの一部として含まれます。 これには、シークレット情報やパスワードを参照する `quarkus` の設定も含まれます。ビルドツールの設定ファイルには、 機密情報を含めないようにしてください。

source: Build time data
ja_jp: ビルド時データ

source: Build time data as defined in the Build step and can be imported using the key and always from `build-time-data`. All keys added in your Build step will be available.
ja_jp: ビルド・ステップで定義されたビルド・タイム・データは、キーを使用して `build-time-data` から常にインポートすることができます。ビルド・ステップで追加されたすべてのキーが使用可能になります。

source: Build time dependencies
ja_jp: ビルドタイム依存関係

source: Build time dependencies will be recorded with the `quarkus:component:scope` property set to `development`:
ja_jp: ビルドタイム依存関係は、 `quarkus:component:scope` プロパティーが `development` に設定されて記録されます。

source: Build time optimizations
ja_jp: ビルド時最適化

source: Build time options, handled during the application build time;
ja_jp: ビルドタイムオプション：アプリケーションのビルド時に処理されます。

source: Build workers
ja_jp: ビルドワーカー

source: Build your application again by enabling the `native` profile:
ja_jp: `native` プロファイルを有効にして、アプリケーションを再度ビルドします。

source: Build your application as a native executable using `mvn clean package -Dnative`.
ja_jp: `mvn clean package -Dnative` を使用して、アプリケーションをネイティブ実行可能ファイルとしてビルドします。

source: Build your application using `mvn clean package`.
ja_jp: `mvn clean package` を使用してアプリケーションを構築します。

source: Build your application with `aot-jar` packaging
ja_jp: `aot-jar` パッケージングでアプリケーションをビルドする

source: Build your project
ja_jp: プロジェクトのビルド

source: Build, Sign and Encrypt JSON Web Tokens
ja_jp: JSONウェブトークン (JWT) のビルド、署名、暗号化

source: Build, Sign and Encrypt JSON Web Tokens (JWT)
ja_jp: JSONウェブトークン（JWT）のビルド、署名、暗号化

source: Build, sign, and encrypt JSON Web Tokens
ja_jp: JSON Web トークン (JWT) のビルド、署名、暗号化

source: Build-Time Code Generation
ja_jp: ビルド時のコード生成
